package com.yiruantong.common.core.enums.base;

import lombok.AllArgsConstructor;
import lombok.Getter;

/**
 * 菜单模块枚举
 */
@Getter
@AllArgsConstructor
public enum MenuEnum {
  /**
   * 预到货单
   */
  MENU_1001(1001, "预到货单"),
  /**
   * 入库计划
   */
  MENU_1002(1002, "残品入库"),
  /**
   * 入库计划
   */
  MENU_1003(1003, "入库计划"),
  /**
   * 质检单
   */
  MENU_1641(1641, "质检单"),
  /**
   * 入库单
   */
  MENU_1650(1650, "入库单"),
  /**
   * 入库单
   */
  MENU_1660(1660, "上架单"),
  /**
   * 波次单
   */
  MENU_1681(1681, "波次单"),
  /**
   * 出库计划单
   */
  MENU_1669(1669, "出库计划单"),
  /**
   * 出库单
   */
  MENU_1671(1671, "出库单"),
  /**
   * 打包校验查询
   */
  MENU_1696(1696, "打包校验查询"),
  /**
   * 生成波次
   */
  MENU_2065(2065, "生成波次"),
  /**
   * 客户信息
   */
  MENU_2063(2063, "客户信息"),
  /**
   * 商品信息
   */
  MENU_1758(1758, "商品信息"),
  /**
   * 货主信息
   */
  MENU_1508(1508, "货主信息"),
  /**
   * 货位转移
   */
  MENU_1042(1042, "货位转移"),
  /**
   * 出库退货单
   */
  MENU_1733(1733, "出库退货单"),
  /**
   * 其他入库单
   */
  MENU_1043(1043, "其他入库单"),
  /**
   * 其他出库单
   */
  MENU_1600(1600, "其他出库单"),
  /**
   * 货主过户
   */
  MENU_1787(1787, "货主过户"),
  /**
   * 库存成本调整
   */
  MENU_1783(1783, "库存成本调整"),
  /**
   * 库存调整
   */
  MENU_1785(1785, "库存调整"),
  /**
   * 效期信息调整
   */
  MENU_1788(1788, "效期信息调整"),
  /**
   * 货位管理
   */
  MENU_1819(1819, "货位管理"),
  /**
   * 供应商信息
   */
  MENU_1762(1762, "供应商信息"),
  /**
   * 拣货下架记录
   */
  MENU_1744(1744, "拣货下架记录"),
  /**
   * 配货记录
   */
  MENU_1745(1715, "配货记录"),
  /**
   * 退货单
   */
  MENU_1661(1661, "退货单"),
  /**
   * 商品拆装单
   */
  MENU_1784(1784, "商品拆装单"),
  /**
   * 调拨申请
   */
  MENU_1793(1793, "调拨申请单"),
  /**
   * 调拨入库
   */
  MENU_1794(1794, "调拨入库单"),
  /**
   * 容器流水记录
   */
  MENU_1810(1810, "容器流水记录"),
  /**
   * 容器借出
   */
  MENU_1811(1811, "容器借出"),
  /**
   * 容器归还
   */
  MENU_1812(1812, "容器归还"),
  /**
   * 容器调整
   */
  MENU_1813(1813, "容器调整"),
  /**
   * 线路管理
   */
  MENU_1844(1844, "线路管理"),
  /**
   * 货主合同
   */
  MENU_1029(1029, "货主合同"),
  /**
   * 货主合同
   */
  MENU_1044(1044, "生成盘点单"),
  /**
   * 缺货转预到货
   */
  MENU_1638(1638, "缺货转预到货"),
  /**
   * 缺货转预到货
   */
  MENU_2067(2067, "建议采购转预到货"),
  /**
   * 生成上架单
   */
  MENU_1652(1652, "生成上架单"),
  /**
   * 出库单拣货记录
   */
  MENU_1746(1746, "出库单拣货记录"),
  /**
   * 库存明细查询
   */
  MENU_1032(1032, "库存明细查询"),
  /**
   * 库存SN查询
   */
  MENU_1770(1770, "库存SN查询"),
  /**
   * 商品库存查询
   */
  MENU_1771(1771, "商品库存查询"),
  /**
   * 库存监测记录
   */
  MENU_1772(1772, "库存监测记录"),
  /**
   * 库存占位查询
   */
  MENU_1774(1774, "库存占位查询"),
  /**
   * 盘点盈亏单
   */
  MENU_1565(1565, "盘点盈亏单"),
  /**
   * 调拨入库单
   */
  MENU_2079(2079, "调拨入库单"),
  /**
   * 在途出库单
   */
  MENU_2080(2080, "在途出库单"),
  /**
   * 调拨出库单
   */
  MENU_2081(2081, "调拨出库单"),
  /**
   * 仓库信息
   */
  MENU_1815(1815, "仓库信息"),
  /**
   * 库区信息
   */
  MENU_1818(1818, "库区信息"),
  /**
   * 容器管理
   */
  MENU_1823(1823, "容器管理"),
  /**
   * 容器使用轨迹
   */
  MENU_1824(1824, "容器使用轨迹"),
  /**
   * 商品入库上架策略
   */
  MENU_1826(1826, "商品入库上架策略"),
  /**
   * 保质期预警
   */
  MENU_2073(2073, "保质期预警"),
  /**
   * 库龄预警
   */
  MENU_2074(2074, "库龄预警"),
  /**
   * 货位最低库存预警
   */
  MENU_2075(2075, "货位最低库存预警"),
  /**
   * 入库计划明细查询
   */
  MENU_500(500, "入库计划明细查询"),
  /**
   * 残品入库明细查询
   */
  MENU_501(501, "残品入库明细查询"),
  /**
   * 预到货单明细查询
   */
  MENU_1639(1639, "预到货单明细查询"),
  /**
   * 入库记录明细查询
   */
  MENU_1640(1640, "入库记录明细查询"),
  /**
   * 上架记录明细查询
   */
  MENU_1653(1653, "上架记录明细查询"),
  /**
   * 到货退货明细查询
   */
  MENU_1673(1673, "到货退货明细查询"),
  /**
   * 出库计划明细查询
   */
  MENU_1674(1674, "出库计划明细查询"),
  /**
   * 出库单明细查询
   */
  MENU_1675(1675, "出库单明细查询"),
  /**
   * 拣货下架明细查询
   */
  MENU_1676(1676, "拣货下架明细查询"),
  /**
   * 出库记录明细查询
   */
  MENU_1883(1883, "出库记录明细查询"),
  /**
   * 货位转移明细查询
   */
  MENU_2056(2056, "货位转移明细查询"),
  /**
   * 盘点单明细查询
   */
  MENU_2057(2057, "盘点单明细查询"),
  /**
   * 盈亏单明细查询
   */
  MENU_2058(2058, "盈亏单明细查询"),
  /**
   * 其他入库明细查询
   */
  MENU_2059(2059, "其他入库明细查询"),
  /**
   * 其他出库明细查询
   */
  MENU_2060(2060, "其他出库明细查询"),
  /**
   * 库存成本调整明细
   */
  MENU_2061(2061, "库存成本调整明细"),
  /**
   * 库存调整明细
   */
  MENU_2066(2066, "库存调整明细"),
  /**
   * 货主过户明细
   */
  MENU_2068(2068, "货主过户明细"),
  /**
   * 效期信息明细
   */
  MENU_2069(2069, "效期信息明细"),
  /**
   * 商品拆装入库明细
   */
  MENU_2070(2070, "商品拆装入库明细"),
  /**
   * 商品拆装出库明细
   */
  MENU_2071(2071, "商品拆装出库明细"),
  /**
   * 容器返厂单
   */
  MENU_2088(2088, "容器返厂单"),
  /**
   * 科目管理
   */
  MENU_1670(1670, "科目管理"),
  /**
   * 承运商管理
   */
  MENU_1859(1859, "承运商管理"),
  /**
   * 网点管理
   */
  MENU_1849(1849, "网点管理"),
  /**
   * 盘点单
   */
  MENU_1601(1601, "盘点单"),
  /**
   * 配送任务
   */
  MENU_1892(1892, "配送任务"),
  /**
   * 运单-发货库存
   */
  MENU_1884(1884, "发货库存"),
  /**
   * 运单-到货库存
   */
  MENU_1887(1887, "到货库存"),
  /**
   * 运单-提货管理
   */
  MENU_1879(1879, "提货管理"),
  /**
   * 运单-运单明细
   */
  MENU_1871(1871, "运单明细"),
  /**
   * 干线运输单
   */
  MENU_1888(1888, "干线运输单"),

  /**
   * 常温运输单
   */
  MENU_18881(18881, "常温运输单"),
  /**
   * 调度下发暂存
   */
  MENU_18883(18883, "调度下发暂存"),
  /**
   * 运单管理
   */
  MENU_1870(1870, "运单管理"),
  /**
   * 常温待运输订单
   */
  MENU_18701(18701, "常温待运输订单"),
  /**
   * 低温待运输订单
   */
  MENU_18702(18702, "低温待运输订单"),
  /**
   * 配送派车单
   */
  MENU_1893(1893, "配送派车单"),
  /**
   * 账单结算
   */
  MENU_2105(2105, "账单结算"),
  /**
   * 异常处理
   */
  MENU_1927(1927, "异常处理"),
  /**
   * 理赔处理
   */
  MENU_1928(1928, "理赔处理"),
  /**
   * 运单追踪
   */
  MENU_2148(2148, "运单追踪"),
  /**
   * 提货派车
   */
  MENU_1880(1880, "提货派车单"),
  /**
   * 保险管理
   */
  MENU_1920(1920, "保险管理"),
  /**
   * 保养计划
   */
  MENU_1919(1919, "保养计划"),
  /**
   * 常规费用登记
   */
  MENU_1918(1918, "常规费用登记"),
  /**
   * 违章登记
   */
  MENU_1917(1917, "违章登记"),
  /**
   * 事故金额往来
   */
  MENU_1916(1916, "事故金额往来"),
  /**
   * 事故登记
   */
  MENU_1915(1915, "事故登记"),
  /**
   * 维修登记
   */
  MENU_1913(1913, "维修登记"),
  /**
   * 保养登记
   */
  MENU_1914(1914, "保养登记"),
  /**
   * 油卡管理
   */
  MENU_1907(1907, "油卡管理"),
  /**
   * 油卡充值
   */
  MENU_1908(1908, "油卡充值"),
  /**
   * 保养登记
   */
  MENU_1909(1909, "油卡消费"),
  /**
   * 保养登记
   */
  MENU_1910(1910, "油卡设置"),
  /**
   * 油卡领用记录
   */
  MENU_1911(1911, "油卡领用记录"),
  /**
   * 付款单
   */
  MENU_2147(2147, "付款单"),
  /**
   * 银行账户
   */
  MENU_2175(2175, "银行账户"),
  /**
   * 账户调整
   */
  MENU_2178(2178, "账户调整"),
  /**
   * 销售单
   */
  MENU_1964(1964, "销售单"),
  /**
   * 开票管理
   */
  MENU_2155(2155, "开票管理"),
  /**
   * 供应商合同
   */
  MENU_1848(1848, "供应商合同"),
  /**
   * 租赁管理
   */
  MENU_1858(1858, "租赁管理"),
  /**
   * 车辆补贴管理
   */
  MENU_1866(1866, "车辆补贴管理"),
  /**
   * 司机合同管理
   */
  MENU_1862(1862, "司机合同管理"),
  /**
   * 账户流水
   */
  MENU_2179(2179, "账户流水"),
  /**
   * 账户间存取款
   */
  MENU_2182(2182, "账户间存取款"),
  /**
   * 挂车管理
   */
  MENU_1865(1865, "挂车管理"),
  /**
   * 收票管理
   */
  MENU_2159(2159, "收票管理"),
  /**
   * 月台管理
   */
  MENU_1857(1857, "月台管理"),
  /**
   * 收货人管理
   */
  MENU_1850(1850, "收货人管理"),
  /**
   * 配件入库
   */
  MENU_1912(1912, "配件入库"),
  /**
   * 发货人管理
   */
  MENU_1030(1030, "发货人管理"),
  /**
   * 对账单查询
   */
  MENU_2171(2171, "对账单查询"),
  /**
   * 车辆出入信息
   */
  MENU_1868(1868, "车辆出入信息"),
  /**
   * 客户合同管理
   */
  MENU_1847(1847, "客户合同管理"),
  /**
   * 垫板入库
   */
  MENU_2180(2180, "垫板入库单"),
  /**
   * 成本报账
   */
  MENU_1894(1894, "成本报账"),
  /**
   * 退料单
   */
  MENU_2199(2199, "退料单"),
  /**
   * 领料单
   */
  MENU_2198(2198, "领料单"),
  /**
   * 成品入库单
   */
  MENU_2200(2200, "成品入库单"),
  /**
   * 采购订单
   */
  MENU_2003(2003, "采购订单"),
  /**
   * 采购退货
   */
  MENU_2004(2004, "采购退货"),
  /**
   * 销售退货
   */
  MENU_2034(2034, "销售退货"),
  /**
   * 退货包裹单
   */
  MENU_2035(2035, "退货包裹单"),
  /**
   * 采购计划
   */
  MENU_1999(1999, "采购计划"),
  /**
   * erp其他出库
   */
  MENU_1998(1998, "erp其他出库"),
  /**
   * 生产工单
   */
  MENU_2201(2201, "生产工单"),
  /**
   * 信保订单
   */
  MENU_1974(1974, "信保订单"),
  /**
   * 单据自动编码
   */
  MENU_1055(1055, "单据自动编码"),
  /**
   * 导入设置
   */
  MENU_1502(1502, "导入设置"),
  /**
   * 导出设置
   */
  MENU_1058(1058, "导出设置"),
  /**
   * 打印模板
   */
  MENU_106(106, "打印模板"),
  /**
   * OSS配置管理
   */
  MENU_2233(2233, "OSS配置管理"),
  /**
   * 补货单
   */
  MENU_2235(2235, "补货单"),
  /**
   * SN调整
   */
  MENU_1789(1789, "SN调整"),
  /**
   * 宝付
   */
  MENU_2222(2222, "宝付"),
  /**
   * 收款对账单
   */
  MENU_2245(2245, "收款对账单"),
  /**
   * 付款对账单
   */
  MENU_2246(2246, "付款对账单"),
  /**
   * 报工记录
   */
  MENU_2204(2204, "报工记录"),
  /**
   * 核销记录
   */
  MENU_2248(2248, "核销记录"),
  /**
   * 收款单
   */
  MENU_2160(2160, "收款单"),
  /**
   * 页面装修
   */
  MENU_2083(2083, "页面装修"),
  /**
   * 报工记录
   */
  MENU_2206(2206, "生产任务单"),
  /**
   * 银联-我的订单
   */
  MENU_2144(2144, "银联-我的订单"),
  /**
   * 出库换货单
   */
  MENU_1734(1734, "出库换货单"),
  /**
   * 发货库存明细载配
   */
  MENU_1885(1885, "发货库存明细载配"),
  /**
   * magic-ui设计器
   */
  MENU_2263(2263, "magic-ui设计器"),
  /**
   * m货代订单
   */
  MENU_2262(2262, "货代订单"),
  /**
   * 询价
   */
  MENU_2280(2280, "询价"),
  /**
   * 货代订单-任务单
   */
  MENU_22621(22621, "货代订单-任务单"),
  /**
   * 货代订单-头程仓入库单号
   */
  MENU_22622(22622, "货代订单-头程仓入库单号"),
  /**
   * 货代订单-熏蒸证
   */
  MENU_22623(22623, "货代订单-熏蒸证"),
  /**
   * 货代订单-产地证
   */
  MENU_22624(22624, "货代订单-产地证"),
  /**
   * 货代订单-MSDS
   */
  MENU_22625(22625, "货代订单-MSDS"),
  /**
   * 货代订单-危包证
   */
  MENU_22626(22626, "货代订单-危包证"),
  /**
   * 货代订单-运输鉴定报关
   */
  MENU_22627(22627, "货代订单-运输鉴定报关"),
  /**
   * 货代订单-中检证
   */
  MENU_22628(22628, "货代订单-中检证"),
  /**
   * 货代订单-缴税
   */
  MENU_22629(22629, "货代订单-缴税"),
  /**
   * 货代订单-报关
   */
  MENU_22630(22630, "货代订单-报关"),
  /**
   * 货代订单-清关
   */
  MENU_22631(22631, "货代订单-清关"),
  /**
   * 货代订单-保险
   */
  MENU_22632(22632, "货代订单-保险"),
  /**
   * 货代订单-报检
   */
  MENU_22633(22633, "货代订单-报检"),
  /**
   * 货代订单-提单
   */
  MENU_22634(22634, "货代订单-提单"),
  /**
   * 货代订单-散货，用于编码使用
   */
  MENU_22635(22635, "货代订单-散货"),
  /**
   * 货代订单-头程仓出库单号
   */
  MENU_22636(22636, "货代订单-头程仓出库单号"),
  /**
   * 货代订单-订舱
   */
  MENU_22637(22637, "货代订单-订舱"),

  /**
   * 质量异议
   */
  MENU_1033(1033, "质量异议"),
  /**
   * 货代报价单
   */
  MENU_2285(2285, "货代报价单"),
  /**
   * 合同管理
   */
  MENU_5001(5001, "合同管理"),
  /**
   * 项目信息管理
   */
  MENU_5003(5003, "项目信息管理"),
  /**
   * 生产商管理
   */
  MENU_5004(5004, "生产商管理"),
  /**
   * 外包管理
   */
  MENU_5005(5005, "外包管理"),
  /**
   * 产品批次
   */
  MENU_5006(5006, "产品批次"),
  /**
   * 防伪码列表
   */
  MENU_5007(5007, "防伪码列表"),
  /**
   * 业务员管理
   */
  MENU_2266(2266, "业务员管理"),
  /**
   * 车辆预算管理
   */
  MENU_5008(5008, "车辆预算管理"),
  /**
   * 用户管理编码规则（宝付）
   */
  MENU_4(4, "用户管理编码规则（宝付）"),
  /**
   * 应收账单
   */
  MENU_2329(2329, "应收账单"),
  /**
   * TMS送货运单
   */
  MENU_4985(4985, "送货运单"),
  /**
   * 订单池
   */
  MENU_5520(5520, "订单池"),
  /**
   * 园区预约单
   */
  MENU_5521(5521, "园区预约单"),
  /**
   * 外部中转运单
   */
  MENU_5561(5561, "外部中转运单"),
  ;

  private final Integer id;
  private final String name;

  public static MenuEnum getEnumById(int menuId) {
//    if(ObjectUtil.isNull(menuId))return null;

    for (var item : MenuEnum.values()) {
      if (item.getId() == menuId) {
        return item;
      }
    }

    return null;
  }
}
